[pipeline]
name = "test-azure"

[[sources]]
type = "azure"
account = "devstoreaccount1"
container = "test-container"
endpoint = "http://azurite:10000/devstoreaccount1"
patterns = ["*.xml"]

[query]
inline = """
PREFIX cim: <http://iec.ch/TC57/CIM100#>
SELECT ?name WHERE {
  ?sub a cim:Substation ;
       cim:IdentifiedObject.name ?name .
}
ORDER BY ?name
"""

[output]
dir = "/output"
formats = ["csv"]
